zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/LPC/LPC5500/LPC5536/iar/startup_LPC5536.s
        PUBWEAK FLEXPWM0_RELOAD3_IRQHandler
        PUBWEAK FLEXPWM0_RELOAD3_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
FLEXPWM0_RELOAD3_IRQHandler
        LDR     R0, =FLEXPWM0_RELOAD3_DriverIRQHandler
        BX      R0

        PUBWEAK FLEXPWM1_CAPTURE_IRQHandler
        PUBWEAK FLEXPWM1_CAPTURE_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
FLEXPWM1_CAPTURE_IRQHandler
        LDR     R0, =FLEXPWM1_CAPTURE_DriverIRQHandler
        BX      R0

        PUBWEAK FLEXPWM1_FAULT_IRQHandler
        PUBWEAK FLEXPWM1_FAULT_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
FLEXPWM1_FAULT_IRQHandler
        LDR     R0, =FLEXPWM1_FAULT_DriverIRQHandler
        BX      R0

        PUBWEAK FLEXPWM1_RELOAD_ERROR_IRQHandler
        PUBWEAK FLEXPWM1_RELOAD_ERROR_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
FLEXPWM1_RELOAD_ERROR_IRQHandler
        LDR     R0, =FLEXPWM1_RELOAD_ERROR_DriverIRQHandler
        BX      R0

        PUBWEAK FLEXPWM1_COMPARE0_IRQHandler
        PUBWEAK FLEXPWM1_COMPARE0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
FLEXPWM1_COMPARE0_IRQHandler
        LDR     R0, =FLEXPWM1_COMPARE0_DriverIRQHandler
        BX      R0

        PUBWEAK FLEXPWM1_RELOAD0_IRQHandler
        PUBWEAK FLEXPWM1_RELOAD0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
FLEXPWM1_RELOAD0_IRQHandler
        LDR     R0, =FLEXPWM1_RELOAD0_DriverIRQHandler
        BX      R0

        PUBWEAK FLEXPWM1_COMPARE1_IRQHandler
        PUBWEAK FLEXPWM1_COMPARE1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
FLEXPWM1_COMPARE1_IRQHandler
        LDR     R0, =FLEXPWM1_COMPARE1_DriverIRQHandler
        BX      R0

        PUBWEAK FLEXPWM1_RELOAD1_IRQHandler
        PUBWEAK FLEXPWM1_RELOAD1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
FLEXPWM1_RELOAD1_IRQHandler
        LDR     R0, =FLEXPWM1_RELOAD1_DriverIRQHandler
        BX      R0

        PUBWEAK FLEXPWM1_COMPARE2_IRQHandler
        PUBWEAK FLEXPWM1_COMPARE2_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
FLEXPWM1_COMPARE2_IRQHandler
        LDR     R0, =FLEXPWM1_COMPARE2_DriverIRQHandler
        BX      R0

        PUBWEAK FLEXPWM1_RELOAD2_IRQHandler
        PUBWEAK FLEXPWM1_RELOAD2_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
FLEXPWM1_RELOAD2_IRQHandler
        LDR     R0, =FLEXPWM1_RELOAD2_DriverIRQHandler
        BX      R0

        PUBWEAK FLEXPWM1_COMPARE3_IRQHandler
        PUBWEAK FLEXPWM1_COMPARE3_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
FLEXPWM1_COMPARE3_IRQHandler
        LDR     R0, =FLEXPWM1_COMPARE3_DriverIRQHandler
        BX      R0

        PUBWEAK FLEXPWM1_RELOAD3_IRQHandler
        PUBWEAK FLEXPWM1_RELOAD3_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
FLEXPWM1_RELOAD3_IRQHandler
        LDR     R0, =FLEXPWM1_RELOAD3_DriverIRQHandler
        BX      R0

        PUBWEAK ENC0_COMPARE_IRQHandler
        PUBWEAK ENC0_COMPARE_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
ENC0_COMPARE_IRQHandler
        LDR     R0, =ENC0_COMPARE_DriverIRQHandler
        BX      R0

        PUBWEAK ENC0_HOME_IRQHandler
        PUBWEAK ENC0_HOME_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
ENC0_HOME_IRQHandler
        LDR     R0, =ENC0_HOME_DriverIRQHandler
        BX      R0

        PUBWEAK ENC0_WDG_IRQHandler
        PUBWEAK ENC0_WDG_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
ENC0_WDG_IRQHandler
        LDR     R0, =ENC0_WDG_DriverIRQHandler
        BX      R0

        PUBWEAK ENC0_IDX_IRQHandler
        PUBWEAK ENC0_IDX_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
ENC0_IDX_IRQHandler
        LDR     R0, =ENC0_IDX_DriverIRQHandler
        BX      R0

        PUBWEAK ENC1_COMPARE_IRQHandler
        PUBWEAK ENC1_COMPARE_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
ENC1_COMPARE_IRQHandler
        LDR     R0, =ENC1_COMPARE_DriverIRQHandler
        BX      R0

        PUBWEAK ENC1_HOME_IRQHandler
        PUBWEAK ENC1_HOME_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
ENC1_HOME_IRQHandler
        LDR     R0, =ENC1_HOME_DriverIRQHandler
        BX      R0

        PUBWEAK ENC1_WDG_IRQHandler
        PUBWEAK ENC1_WDG_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
ENC1_WDG_IRQHandler
        LDR     R0, =ENC1_WDG_DriverIRQHandler
        BX      R0

        PUBWEAK ENC1_IDX_IRQHandler
        PUBWEAK ENC1_IDX_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
ENC1_IDX_IRQHandler
        LDR     R0, =ENC1_IDX_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved126_IRQHandler
        PUBWEAK Reserved126_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved126_IRQHandler
        LDR     R0, =Reserved126_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved127_IRQHandler
        PUBWEAK Reserved127_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved127_IRQHandler
        LDR     R0, =Reserved127_DriverIRQHandler
        BX      R0

        PUBWEAK ELS_ERR_IRQHandler
        PUBWEAK ELS_ERR_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
ELS_ERR_IRQHandler
        LDR     R0, =ELS_ERR_DriverIRQHandler
        BX      R0

        PUBWEAK PKC_ERR_IRQHandler
        PUBWEAK PKC_ERR_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
PKC_ERR_IRQHandler
        LDR     R0, =PKC_ERR_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved130_IRQHandler
        PUBWEAK Reserved130_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved130_IRQHandler
        LDR     R0, =Reserved130_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved131_IRQHandler
        PUBWEAK Reserved131_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved131_IRQHandler
        LDR     R0, =Reserved131_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved132_IRQHandler
        PUBWEAK Reserved132_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved132_IRQHandler
        LDR     R0, =Reserved132_DriverIRQHandler
        BX      R0

