zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/LPC/LPC5500/LPC5536/iar/startup_LPC5536.s
        PUBWEAK Reserved133_IRQHandler
        PUBWEAK Reserved133_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved133_IRQHandler
        LDR     R0, =Reserved133_DriverIRQHandler
        BX      R0

        PUBWEAK FLASH_IRQHandler
        PUBWEAK FLASH_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
FLASH_IRQHandler
        LDR     R0, =FLASH_DriverIRQHandler
        BX      R0

        PUBWEAK RAM_PARITY_ECC_ERR_IRQHandler
        PUBWEAK RAM_PARITY_ECC_ERR_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
RAM_PARITY_ECC_ERR_IRQHandler
        LDR     R0, =RAM_PARITY_ECC_ERR_DriverIRQHandler
        BX      R0

WDT_BOD_DriverIRQHandler
DMA0_DriverIRQHandler
GINT0_DriverIRQHandler
GINT1_DriverIRQHandler
PIN_INT0_DriverIRQHandler
PIN_INT1_DriverIRQHandler
PIN_INT2_DriverIRQHandler
PIN_INT3_DriverIRQHandler
UTICK0_DriverIRQHandler
MRT0_DriverIRQHandler
CTIMER0_DriverIRQHandler
CTIMER1_DriverIRQHandler
SCT0_DriverIRQHandler
CTIMER3_DriverIRQHandler
FLEXCOMM0_DriverIRQHandler
FLEXCOMM1_DriverIRQHandler
FLEXCOMM2_DriverIRQHandler
FLEXCOMM3_DriverIRQHandler
FLEXCOMM4_DriverIRQHandler
FLEXCOMM5_DriverIRQHandler
FLEXCOMM6_DriverIRQHandler
FLEXCOMM7_DriverIRQHandler
ADC0_DriverIRQHandler
ADC1_DriverIRQHandler
ACMP_DriverIRQHandler
DMIC_DriverIRQHandler
HWVAD0_DriverIRQHandler
USB0_NEEDCLK_DriverIRQHandler
USB0_DriverIRQHandler
RTC_DriverIRQHandler
EZH_ARCH_B0_DriverIRQHandler
WAKEUP_DriverIRQHandler
PIN_INT4_DriverIRQHandler
PIN_INT5_DriverIRQHandler
PIN_INT6_DriverIRQHandler
PIN_INT7_DriverIRQHandler
CTIMER2_DriverIRQHandler
CTIMER4_DriverIRQHandler
OS_EVENT_DriverIRQHandler
FlexSPI0_DriverIRQHandler
Reserved56_DriverIRQHandler
Reserved57_DriverIRQHandler
Reserved58_DriverIRQHandler
CAN0_IRQ0_DriverIRQHandler
CAN0_IRQ1_DriverIRQHandler
Reserved61_DriverIRQHandler
Reserved62_DriverIRQHandler
Reserved63_DriverIRQHandler
Reserved64_DriverIRQHandler
SEC_HYPERVISOR_CALL_DriverIRQHandler
SEC_GPIO_INT0_IRQ0_DriverIRQHandler
SEC_GPIO_INT0_IRQ1_DriverIRQHandler
Freqme_DriverIRQHandler
SEC_VIO_DriverIRQHandler
ELS_DriverIRQHandler
PKC_DriverIRQHandler
Reserved72_DriverIRQHandler
POWERQUAD_DriverIRQHandler
DMA1_DriverIRQHandler
FLEXCOMM8_DriverIRQHandler
CDOG_DriverIRQHandler
Reserved77_DriverIRQHandler
I3C0_DriverIRQHandler
Reserved79_DriverIRQHandler
Reserved80_DriverIRQHandler
ELS_IRQ1_DriverIRQHandler
Tamper_DriverIRQHandler
Reserved83_DriverIRQHandler
Reserved84_DriverIRQHandler
Reserved85_DriverIRQHandler
Reserved86_DriverIRQHandler
Reserved87_DriverIRQHandler
Reserved88_DriverIRQHandler
Reserved89_DriverIRQHandler
DAC0_DriverIRQHandler
DAC1_DriverIRQHandler
DAC2_DriverIRQHandler
HSCMP0_DriverIRQHandler
HSCMP1_DriverIRQHandler
HSCMP2_DriverIRQHandler
FLEXPWM0_CAPTURE_DriverIRQHandler
FLEXPWM0_FAULT_DriverIRQHandler
FLEXPWM0_RELOAD_ERROR_DriverIRQHandler
FLEXPWM0_COMPARE0_DriverIRQHandler
FLEXPWM0_RELOAD0_DriverIRQHandler
FLEXPWM0_COMPARE1_DriverIRQHandler
FLEXPWM0_RELOAD1_DriverIRQHandler
FLEXPWM0_COMPARE2_DriverIRQHandler
FLEXPWM0_RELOAD2_DriverIRQHandler
FLEXPWM0_COMPARE3_DriverIRQHandler
FLEXPWM0_RELOAD3_DriverIRQHandler
FLEXPWM1_CAPTURE_DriverIRQHandler
FLEXPWM1_FAULT_DriverIRQHandler
FLEXPWM1_RELOAD_ERROR_DriverIRQHandler
FLEXPWM1_COMPARE0_DriverIRQHandler
FLEXPWM1_RELOAD0_DriverIRQHandler
FLEXPWM1_COMPARE1_DriverIRQHandler
FLEXPWM1_RELOAD1_DriverIRQHandler
FLEXPWM1_COMPARE2_DriverIRQHandler
FLEXPWM1_RELOAD2_DriverIRQHandler
FLEXPWM1_COMPARE3_DriverIRQHandler
FLEXPWM1_RELOAD3_DriverIRQHandler
ENC0_COMPARE_DriverIRQHandler
ENC0_HOME_DriverIRQHandler
ENC0_WDG_DriverIRQHandler
ENC0_IDX_DriverIRQHandler
ENC1_COMPARE_DriverIRQHandler
ENC1_HOME_DriverIRQHandler
ENC1_WDG_DriverIRQHandler
ENC1_IDX_DriverIRQHandler
Reserved126_DriverIRQHandler
Reserved127_DriverIRQHandler
ELS_ERR_DriverIRQHandler
PKC_ERR_DriverIRQHandler
Reserved130_DriverIRQHandler
Reserved131_DriverIRQHandler
Reserved132_DriverIRQHandler
Reserved133_DriverIRQHandler
FLASH_DriverIRQHandler
RAM_PARITY_ECC_ERR_DriverIRQHandler
DefaultISR
        B .

        END
